In [1]:
# Import libraries

import pandas as pd

In [2]:
df = pd.read_csv("adult.data.csv")
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [6]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
age,32561.0,38.581647,13.640433,17.0,28.0,37.0,48.0,90.0
fnlwgt,32561.0,189778.366512,105549.977697,12285.0,117827.0,178356.0,237051.0,1484705.0
education-num,32561.0,10.080679,2.572720,1.0,9.0,10.0,12.0,16.0
capital-gain,32561.0,1077.648844,7385.292085,0.0,0.0,0.0,0.0,99999.0
capital-loss,32561.0,87.303830,402.960219,0.0,0.0,0.0,0.0,4356.0
hours-per-week,32561.0,40.437456,12.347429,1.0,40.0,40.0,45.0,99.0

# Questin 1

How many people of each race are represented in this dataset? 
This should be a Pandas series with race names as the index labels. 
(`race` column)

In [22]:
race = df['race'].value_counts()

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

# Qustion 2
What is the average age of men?

In [41]:
men_data = df[df['sex'] == 'Male']
round(men_data['age'].mean())

39

# Question 3
What is the percentage of people who have a Bachelor's degree?

In [57]:
edu_percent = pd.DataFrame(df['education'].sort_values().value_counts())
edu_percent['percentage'] = edu_percent['education']/edu_percent['education'].sum()
bach = edu_percent['percentage'].loc['Bachelors']
bach

0.16446055096587942

# Question 4

What percentage of people with advanced education 
(`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?

In [150]:
def transform(dataframe):
    '''
    A function to transform the df to usable information
    '''

    edu_sal = pd.DataFrame(df[['education', 'salary']].value_counts()).rename(columns={0:'counts'}).reset_index()
    edu_sal['percentage'] = edu_sal['counts']/edu_sal['counts'].sum()
    return edu_sal

In [177]:
def final_sol(dataframe):
    '''
    A function to pick the right education
    levels and sum up the precentage
    '''
    dataframe= transform(df)

    sol_list = []
    for row in dataframe.itertuples():
        '''
        I am using itertuples to loop through the rows
        '''
        if row[1] == 'Bachelors' and row[2] == '>50K':
            sol_list.append(row[4])
        elif row[1] == "Masters" and row[2] == '>50K':
            sol_list.append(row[4])
        elif row[1] == "Doctorate" and row[2] == '>50K':
            sol_list.append(row[4])

    return round(sum(sol_list), 2)

In [178]:
solution = final_sol(df2)
solution

0.11

In [159]:
df2 = transform(df)
df2

       education salary  counts  percentage
0        HS-grad  <=50K    8826    0.271060
1   Some-college  <=50K    5904    0.181321
2      Bachelors  <=50K    3134    0.096250
3      Bachelors   >50K    2221    0.068210
4        HS-grad   >50K    1675    0.051442
5   Some-college   >50K    1387    0.042597
6           11th  <=50K    1115    0.034243
7      Assoc-voc  <=50K    1021    0.031357
8        Masters   >50K     959    0.029452
9           10th  <=50K     871    0.026750
10    Assoc-acdm  <=50K     802    0.024631
11       Masters  <=50K     764    0.023464
12       7th-8th  <=50K     606    0.018611
13           9th  <=50K     487    0.014957
14   Prof-school   >50K     423    0.012991
15          12th  <=50K     400    0.012285
16     Assoc-voc   >50K     361    0.011087
17       5th-6th  <=50K     317    0.009736
18     Doctorate   >50K     306    0.009398
19    Assoc-acdm   >50K     265    0.008139
20       1st-4th  <=50K     162    0.004975
21   Prof-school  <=50K     153    0.004699
22     Doctorate  <=50K     107    0.003286
23          10th   >50K      62    0.001904
24          11th   >50K      60    0.001843
25     Preschool  <=50K      51    0.001566
26       7th-8th   >50K      40    0.001228
27          12th   >50K      33    0.001013
28           9th   >50K      27    0.000829
29       5th-6th   >50K      16    0.000491
30       1st-4th   >50K       6    0.000184